{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2e503cc8",
   "metadata": {},
   "outputs": [],
   "source": [
    "def f(x, y):\n",
    "    if x > y or x == 11 or x == 17:\n",
    "        return 0\n",
    "    if x == y:\n",
    "        return 1\n",
    "    else:\n",
    "        return f(x + 1, y) + f(x + 4, y) + f(x * 2, y)\n",
    "print(f(5,10)*f(10,18))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "016c39fa",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Исполнитель преобразует число на экране. У исполнителя есть две команды, которые обозначены латинскими буквами:\n",
    "# A. Прибавить 2.\n",
    "# B. Умножить на 3.\n",
    "# Программа для исполнителя — это последовательность команд.\n",
    "# Сколько различных чисел можно получить с помощью программы из четырёх команд из числа 1?\n",
    "# 1 способ\n",
    "def f(x, y):\n",
    "    if y == 0:\n",
    "        return 1\n",
    "    else:\n",
    "        return f(x + 2, y-1) + f(x * 3, y-1)\n",
    "print(f(1,4)) # получаем 16, но поскольку на первом\n",
    "# шаге мы получаем 3 и 3, то 16/2, что бы получить количество уникальных чисел\n",
    "# 2 способ\n",
    "from itertools import *\n",
    "q = []\n",
    "w = []\n",
    "# product - все комбинации (с повоторениями) (рабоатет с исходных алфавитом)\n",
    "# permutations -  все комбинации (с без повторений) (ограничение по длине алфавита)\n",
    "# for i in permutations('ab',r=4) -> ['ab', 'ba']\n",
    "# for i in product('ab',repeat=4): -> ['aaaa', 'aaab', 'aaba', 'aabb', 'abaa', 'abab',\n",
    "# 'abba', 'abbb', 'baaa', 'baab', 'baba', 'babb', 'bbaa', 'bbab', 'bbba', 'bbbb']\n",
    "for i in product('ab',repeat=4):\n",
    "    q.append(''.join(i))\n",
    "for i in q:\n",
    "    c = 1\n",
    "    for j in i:\n",
    "        if j == 'a':\n",
    "            c += 2\n",
    "        elif j == 'b':\n",
    "            c *= 3\n",
    "    w.append(c)\n",
    "print(len(set(w)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4b4a35ce",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Исполнитель преобразует число на экране.\n",
    "# У исполнителя есть две команды, которым присвоены номера:\n",
    "# Вычти 1.\n",
    "# Найди целую часть от деления на 2.\n",
    "# Первая из них уменьшает число на экране на 1, вторая заменяет число на экране на целую часть от деления числа на 2.\n",
    "# Программа для исполнителя – это последовательность команд.\n",
    "# Сколько существует программ, для которых при исходном числе 30 результатом является число 1,\n",
    "#  и при этом траектория вычислений содержит число 13?\n",
    "# Траектория вычислений программы — это последовательность результатов выполнения всех команд программы. \n",
    "# Например, для программы 122 при исходном числе 10 траектория состоит из чисел 9, 4, 2.\n",
    "def f(x, y):\n",
    "    if x < y:\n",
    "        return 0\n",
    "    if x == y:\n",
    "        return 1\n",
    "    else:\n",
    "        return f(x-1, y) + f(x // 2, y)\n",
    "print(f(30,13)*f(13,1))"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
