#!/usr/bin/env python
# coding: utf-8

# In[42]:


# 1. Сохранияем ЕХ как СSV
# 2. Заменяем ковычки в тхт на пустоту(просто удаляем через заменить все)
# 3. Создаем переменную с тройными ковычками и вставляем значения из тхт
a = """10026;18;0;
10123;4;0;
10208;41;10026;10123;
10218;92;0;
10251;10;0;
10285;70;10026;10218;
10374;41;0;
10423;44;0;
10495;2;10218;
10594;13;0;
10629;59;0;
10707;55;10629;
10746;35;10707;
10824;25;10123;
10856;33;10707;
10954;40;10374;10856;
10980;91;10824;
10994;23;10594;
11040;72;0;
11125;19;0;
11177;8;10026;
11229;23;10856;
11245;100;10594;11040;
11324;7;0;
11422;67;10954;11229;
11502;5;10374;
11593;42;0;
11612;3;10026;
11680;19;0;
11742;42;10629;
11777;93;0;
11842;41;10208;10980;
11930;48;10707;10824;
11971;76;11502;11593;
12024;99;11229;11245;
12107;50;11177;
12201;94;12024;12107;
12299;44;10707;11040;
12344;17;0;
12371;33;11502;
12380;10;10856;11612;
12460;32;10980;12371;
12521;25;10994;11842;
12607;7;0;
12690;81;0;
12783;28;10123;12521;
12804;93;12607;12783;
12858;28;0;
12931;83;0;
13015;75;0;
13097;45;11612;
13159;97;10629;11593;
13237;95;12024;
13265;3;12024;
13280;93;0;
13340;20;11930;12024;
13375;50;12107;
13378;85;0;
13391;81;10423;
13421;61;10374;
13440;29;11422;11971;
13520;99;11324;12380;
13523;90;0;
13613;43;0;
13658;75;10251;12783;
13720;94;11422;
13734;28;13280;
13799;69;0;
13877;34;12380;13799;
13892;9;0;
13896;37;0;
13896;74;0;
13952;86;0;
13985;71;11842;
14011;61;0;
14033;33;0;
14115;25;11930;
14187;42;0;
14187;80;0;
14255;93;13952;14115;
14301;81;0;
14336;16;13877;
14425;18;0;
14490;79;10423;
14552;31;10251;11502;
14569;52;13613;14552;
14630;60;13391;13892;
14634;66;13265;13896;
14685;51;14552;
14746;69;12804;13340;
14762;48;13375;13896;
14788;29;13159;13421;
14801;24;0;
14812;22;0;
14833;80;13877;
14867;69;0;
14964;82;0;
15030;85;0;
15058;27;0;
15078;20;10856;14964;"""
# 4. Из строки в список
q = a.split() 
print(q) # проверка
n = len(q) # взяли длину списка
s = [] # создали новый список
# создаем много маленьких массивов и одном большом
# пример q[0] = '10026;18;0;' 
# мы удаляем все ";" и переводим в тип int
# split(";") значит мы применяем функцию до последней ";"
for i in range(n): 
#      rstrip(";") удаляет ";" с начала строки
    s.append(list(map(int,q[i].rstrip(";").split(";"))))
print(s)
# создаем словарь
proc = dict()
# словарь заполняется (ключ : значение) id : мс
# i = [10026, 18, 0]
for i in s:
#   если последний элемент в i = 0, то 
# ключ = 10026, значение = 18
    if i[-1] == 0:
        proc[i[0]] = i[1]
    else:
#   иначе i = [10208, 41, 10026, 10123] - последний элемент не = 0
# создаем переменную maxx
# и теперь создаем новый цикл, который будет искать из словаря
# значения (мс) предпоследнего и последнего id (10026, 10123)
# после выбирает максимальное значение (мс) из двух id (10026, 10123)
# после к полученному максимаму прибавляем значение самого i = 41 (второе значение массива)
        maxx = 0
        for j in i[2:]:
            maxx = max(proc[j],maxx)
        proc[i[0]] = i[1] + maxx
print(proc)
time = []
# в массив time мы добавляем значения из словаря
for i in proc.values():
    time.append(i)
print(time)
# сортируем
time.sort()
print(time)
# мы ищем нужный тайминг
c = 0
for i in time:
    if i <= 170:
        c += 1
    else:
        break
print(c)


# In[ ]:




