{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5a0306b2",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Два игрока, Петя и Ваня, решили поиграть. Перед ними лежат две кучи камней. Игроки ходят по очереди, \n",
    "# первый ход делает Петя. За один ход игрок может добавить в одну из куч (по своему выбору) \n",
    "# три камня или увеличить количество камней в куче в два раза.\n",
    "# Игра завершается в тот момент, когда суммарное количество камней в кучах становится не менее 143.\n",
    "# Победителем считается игрок, сделавший последний ход, т. е. первым получивший суммарно 143 или больше камней в кучах.\n",
    "# В начальный момент в первой куче было 16 камней, во второй куче — S камней; 1≤S ≤123.\n",
    "# Известно, что Ваня выиграл своим первым ходом после неудачного первого хода Пети.\n",
    "# Укажите минимальное значение S, когда такая ситуация возможна.\n",
    "def f(a,b,m):\n",
    "    if a+b>=143: return m%2==0\n",
    "    if m == 0: return 0\n",
    "    h = [f(a+3,b,m-1), f(a*2,b,m-1),f(a,b+3,m-1), f(a,b*2,m-1)]\n",
    "    if m%2 != 0: return any(h)\n",
    "    else: any(h)\n",
    "print('19)' ,min([s for s in range(1,124) if f(16,s,2)]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e63f7516",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит куча камней. \n",
    "# Игроки ходят по очереди, первый ход делает Петя.\n",
    "# Игрокам доступны следующие ходы:\n",
    "# •\tУменьшить количество камней в три раза,\n",
    "# •\tУбрать из кучи 10 камней.\n",
    "# Например, из кучи из 25 камней можно получить кучу из 8 или 15 камней. \n",
    "# В таком случае результат кратного уменьшения округляется вниз (берётся целая часть).\n",
    "# Игра завершается в тот момент, когда количество камней в куче становится не более 10. \n",
    "# Победителем считается игрок, совершивший последний ход.\n",
    "# В начальный момент в куче было S камней; 11 ≤ S ≤ 200.\n",
    "# Известно, что Ваня выиграл своим первым ходом после неудачного хода Пети. \n",
    "# При каком максимальном значении S такое возможно?\n",
    "def f(a,m):\n",
    "    if a<=10: return m%2==0\n",
    "    if m == 0: return 0\n",
    "    h = [f(a//3,m-1), f(a-10,m-1)]\n",
    "    if m%2 != 0: return any(h)\n",
    "    else: any(h)\n",
    "print('19)' ,max([s for s in range(11,201) if f(s,2)]))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ed91c1f6",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Петя и Ваня решили поиграть. Перед ними лежат две кучи камней. Мальчики ходят по очереди, первый ход делает Петя. \n",
    "# За один ход игрок может добавить в одну из куч (по своему выбору) 3 камня или увеличить в одной из \n",
    "# куч количество камней в 2 раза. Для того чтобы делать ходы, у каждого игрока есть неограниченное количество камней.\n",
    "# Игра завершается в тот момент, когда суммарное количество камней в кучах становится не менее 503. \n",
    "# Победителем считается игрок, который сделал последний ход, т. е. первым получил такую позицию, \n",
    "# при которой в кучах будет 503 или больше камней.\n",
    "# В начальный момент в первой куче было 15 камней, во второй куче — S камней; 1 ≤ S ≤ 487.\n",
    "# Будем говорить, что у игрока выигрышная стратегия, если он может выиграть при любых ходах противника.\n",
    "# Известно, что Ваня выиграл своим первым ходом после неудачного первого хода Пети. \n",
    "# Укажите минимальное значение S, при котором такая ситуация возможна.\n",
    "def f(a,b,m):\n",
    "    if a+b>=503: return m%2==0\n",
    "    if m == 0: return 0\n",
    "    h = [f(a+3,b,m-1), f(a*2,b,m-1),f(a,b+3,m-1), f(a,b*2,m-1)] \n",
    "    if m%2 != 0: return any(h)\n",
    "    else: any(h)\n",
    "print('19)' ,min([s for s in range(1,488) if f(16,s,2)]))\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d64149ca",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежат две кучи камней. \n",
    "# Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может добавить в меньшую кучу один или три камня. \n",
    "# Изменять количество камней в большей куче не разрешается. \n",
    "# Игра завершается, когда количество камней в кучах становится равным. \n",
    "# Победителем считается игрок, сделавший последний ход, то есть первым сравнявшим количество камней в двух кучах. \n",
    "# Игроки играют рационально, т. е. без ошибок. В начальный момент в первой куче было 13 камней, \n",
    "# а во второй — S камней, 1≤S≤23;S≠13.\n",
    "# Укажите такое минимальное значение S, при котором Петя не может выиграть за один ход, \n",
    "# но при любом ходе Пети Ваня может выиграть своим первым ходом.\n",
    "def f(a,b,m):\n",
    "    if a==b: return m%2==0\n",
    "    if m == 0: return 0\n",
    "    if a<b:\n",
    "        h = [f(a+1,b,m-1), f(a+3,b,m-1)]\n",
    "    else:\n",
    "        h = [f(a,b+1,m-1), f(a,b+3,m-1)]\n",
    "    return any(h) if m%2 != 0 else all(h)\n",
    "print('19)' ,min([s for s in range(1,24) if f(13,s,2) and s!=13 ]))\n",
    "\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
