{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8120a8ee",
   "metadata": {},
   "outputs": [],
   "source": [
    "# # открываем файл в виде списка\n",
    "a = open(\"9 вариант 1.csv\").read().split()\n",
    "q = [list(map(int,i.split(';'))) for i in a]\n",
    "print(q)\n",
    "c = 0\n",
    "for i in q:\n",
    "    w = [e for e in i if i.count(e) == 3]\n",
    "    r = [e for e in i if i.count(e) == 1]\n",
    "    if len(w)>0:\n",
    "        if (len(set(i)) != max(w)) and (len(set(w)) == 2) and len(r) == 2:\n",
    "            c += 1\n",
    "            print(i)\n",
    "print(c)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9eea9148",
   "metadata": {},
   "outputs": [],
   "source": [
    "a = open(\"demo_2025_9.csv\").read().split()\n",
    "q = [list(map(int,i.split(';'))) for i in a]\n",
    "c = 0\n",
    "for i in q:\n",
    "    w = ([e for e in i if i.count(e) == 3])\n",
    "    r = [e for e in i if i.count(e) == 1]\n",
    "    if len(w) == 3 and len(r) == 3:\n",
    "        if sum(w)**2 > sum(r)**2:\n",
    "            c += 1\n",
    "print(c)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f2975f58",
   "metadata": {},
   "outputs": [],
   "source": [
    "a = open(\"02101.csv\").read().split()\n",
    "print(a)\n",
    "q = [list(map(int,i.split(';'))) for i in a]\n",
    "print(q)\n",
    "c = 0\n",
    "for i in q:\n",
    "    if len(set(i)) == 3:\n",
    "        if i[0] < i[1] < i[2]:\n",
    "            c+=1\n",
    "print(c)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f09a51d1",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Откройте файл электронной таблицы, содержащей почасовые данные метеорологической станции за два года. Определите количество строк таблицы, для чисел которых выполнены оба условия:\n",
    "# •\tощущаемая температура меньше точной температуры (колонка «Температура») хотя бы на 5 градусов\n",
    "# •\tветер северный, то есть направление ветра либо от 0 до 45 градусов (включительно), либо от 315 до 360 градусов (включительно)\n",
    "# В ответе запишите только число.\n",
    "# Сначала удаляем из xls файла ненужные столбцы, затем сохраняем в формате CSV(MS_DOS)\n",
    "# open(\"20_11_2.csv\") открыть файл  \n",
    "# read() - чтение. Откроется так:\n",
    "# 0,5778;-4,05;140\n",
    "# 1,1611;-3,2389;139\n",
    "# 1,6667;-3,1556;140\n",
    "# split() - представить в виде единного списка содержащего много строк\n",
    "# ['0,5778;-4,05;140', '1,1611;-3,2389;139', ... ,'1,6667;-3,1556;140']\n",
    "a = open(\"20_11_2.csv\").read().split() \n",
    "print(\"Температура(C)\",\"Ощущаемая Температура(C)\",\"Направление Ветра(градусы)\")\n",
    "q = [list(map(str,i.split(';'))) for i in a] # переводим строки в списки [['0,5778', '-4,05', '140'], ... ,['1,1611', '-3,2389', '139']]\n",
    "c = 0\n",
    "for i in q:\n",
    "    i[0] = i[0].replace(',','.',1) # 0,5778 -> 0.5778   меняем , на . в первом числе\n",
    "    i[1] = i[1].replace(',','.',1) # -4,05 -> -4.05  меняем , на . во втором числе\n",
    "    if float(i[0]) - float(i[1]) >= 5:   # ощущаемая температура меньше точной температуры (колонка «Температура») хотя бы на 5 градусов \n",
    "        if 0<=float(i[2])<=45 or 315<=float(i[2])<=360:  # ветер северный, то есть направление ветра либо от 0 до 45 градусов (включительно), либо от 315 до 360 градусов (включительно)\n",
    "            print(i)\n",
    "            c+= 1\n",
    "print(c)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "12da3212",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n",
    "# •\tнаибольшее из четырёх чисел меньше суммы трёх других;\n",
    "# •\tчетыре числа можно разбить на две пары чисел с равными суммами.\n",
    "# В ответе запишите только число.\n",
    "a = open(\"20_11_1.csv\").read().split() \n",
    "q = [list(map(int,i.split(';'))) for i in a]   # переводим весь список строк в список списков, состоящих из чисел \n",
    "# ['12;534;234;54', ... ,'1611;2389;139;556']->[[12, 534, 234, 54], ... ,[1611, 2389, 139, 556]]\n",
    "# i.split(';') разбивает строку в список по маркеру \";\". Пример \"12;65;98;7\" -> [\"12\",\"65\",\"98\",\"7\"]\n",
    "# list(map(int,i.split(';'))) переводит все элементы с списке в числа [\"12\",\"65\",\"98\",\"7\"] -> [12,65,98,7]\n",
    "c = 0\n",
    "for i in q:\n",
    "    if max(i) < (sum(i) - max(i)):\n",
    "        if (i[0]+i[1] == i[2]+i[3]) or (i[0]+i[2] == i[3]+i[1]) or (i[0]+i[3] == i[1]+i[2]):\n",
    "            c += 1\n",
    "print(c) "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0436772e",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Откройте файл электронной таблицы, содержащей в каждой строке семь натуральных чисел. \n",
    "# Найдите наибольший номер строки таблицы, для чисел которой выполнены оба условия:\n",
    "# •\tв строке есть одно число, которое повторяется трижды, остальные числа различны;\n",
    "# •\tколичество чётных чисел превышает количество нечётных.\n",
    "# В ответе запишите только число.\n",
    "a = open(\"21_11_1.csv\").read().split()\n",
    "q = [list(map(int,i.split(';'))) for i in a]\n",
    "c = 0\n",
    "for i in q:\n",
    "    c += 1 # счистаем каждую строку\n",
    "    if len(set(i)) == 5: # берем только строки с 5 разными значениями\n",
    "        w = list(set(i)) # переводим множество в список что бы вытаскивать значения по индексам\n",
    "        # хотя бы 1 из 5 значений должно повторяться в исходном списке 3 раза\n",
    "        if (i.count(w[0]) == 3) or (i.count(w[1]) == 3) or (i.count(w[2]) == 3) or (i.count(w[3]) == 3) or (i.count(w[3]) == 3):\n",
    "            chet = [a for a in i if a%2==0] # из исходного списка берем четные числа\n",
    "            nechet = [a for a in i if a%2!=0] # из исходного списка берем нечетные числа\n",
    "            if len(chet) > len(nechet):\n",
    "                print(i,c) # если количество четных чисел > нечетных то выводим список и его порядкоый номер\n",
    "                # ответом будет порядковый номер последней строки\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
