{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5638e766",
   "metadata": {},
   "outputs": [],
   "source": [
    "# На предприятии каждой изготовленной детали присваивают серийный номер, состоящий из 105 символов. \n",
    "# В базе данных каждый серийный номер занимает одинаковое и минимально возможное число байт. \n",
    "# При этом используется посимвольное кодирование серийных номеров, все символы кодируются одинаковым и минимально возможным числом бит. \n",
    "# Известно, что для хранения 65 536 серийных номеров потребовалось не менее 7 Мбайт памяти. \n",
    "# Определите минимально возможную мощность алфавита, используемого для записи серийных номеров. В ответе запишите только целое число.\n",
    "from math import *\n",
    "for N in range(100,1000):\n",
    "    i = ceil(log(N,2))\n",
    "    if (i*105/8*65536 >= 7*2**20) == 1:\n",
    "        print(N)\n",
    "        break\n",
    "# Если считать вручную, мы получаем i = 8.533333...\n",
    "# Мы берем i=8 (округляем в меньшую сторону), находим N = 2**8+1. Прибавляем 1, потому что ищем минимальную мощность алфавита.\n",
    "# Если возьмем N = 2**8=256 это мало, N = 2**9=512 это не минимальное значение.\n",
    "# Если через код проверим N = 257, то получим значение, удовлетворяющее выражению.\n",
    "# ceil(log(N,2)) -> log(N,2)- находит логарифм числа N по основанию 2. ceil-> округляет значение"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
