{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1b847fd9",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Фрагмент звёздного неба спроецирован на плоскость с декартовой системой координат. Учёный решил провести кластеризацию полученных точек, являющихся изображениями звёзд, то есть разбить их множество на \n",
    "#  непересекающихся непустых подмножеств (кластеров), таких что точки каждого подмножества лежат внутри прямоугольника со сторонами длиной \n",
    "#  и причём эти прямоугольники между собой не пересекаются. Стороны прямоугольников не обязательно параллельны координатным осям. Гарантируется, что такое разбиение существует и единственно для заданных размеров прямоугольников.\n",
    "# Будем называть центром кластера точку этого кластера, сумма расстояний от которой до всех остальных точек кластера минимальна. Для каждого кластера гарантируется единственность его центра. Расстояние между двумя точками на плоскости \n",
    "#  и вычисляется по формуле:В файле А хранятся данные о звёздах двух кластеров, где \n",
    "#  для каждого кластера. В каждой строке записана информация о расположении на карте одной звезды: сначала координата \n",
    "#  затем координата #  Значения даны в условных единицах. Известно, что количество звёзд не превышает \n",
    "# В файле В хранятся данные о звёздах трёх кластеров, где для каждого кластера. Известно, что количество звёзд не превышает \n",
    "#  Структура хранения информации о звездах в файле В аналогична файлу А.Известно, что в файле B имеются координаты ровно трёх «лишних» точек, являющихся аномалиями, возникшими в результате помех при передаче данных. Эти три точки не относятся ни к одному из кластеров, их учитывать не нужно.\n",
    "# Для файла А определите координаты центра каждого кластера, затем найдите два числа: \n",
    "#  — сумму абсцисс центров кластеров, и — сумму ординат центров кластеров. Для файла B определите координаты центра каждого кластера, затем найдите два числа: \n",
    "#  — минимальное расстояние от центра кластера до начала координат, и \n",
    "#  — максимальное расстояние от центра кластера до начала координат.\n",
    "# В ответе запишите четыре числа: в первой строке — сначала абсолютную величину целой части произведения затем абсолютную величину целой части произведения во второй строке — сначала целую часть произведения \n",
    "#  затем целую часть произведения Возможные данные одного из файлов иллюстрированы графиком.\n",
    "from math import dist # dist - расстояние от [x1, y1] до [x2, y2]\n",
    "# всё равно что: ((x2 - x1)**2 + (y2 - y1)**2)**0.5\n",
    "\n",
    "clastersA = [[],[]]\n",
    "for i in open('27_A_23384.txt'): # разделяем точки из файла A на сластеры\n",
    "    x, y = [float(j) for j in i.split()]\n",
    "    if y > 10:\n",
    "        clastersA[0].append([x, y])\n",
    "    else:\n",
    "        clastersA[1].append([x, y])\n",
    "\n",
    "clastersB = [[], [], []] # тоже самое для файла B\n",
    "for i in open('27_B_23384.txt'):\n",
    "    x, y = [float(j) for j in i.split()]\n",
    "    if y > 30 or y < 0:\n",
    "        pass # убераем лишние точки\n",
    "    elif x > 20:\n",
    "        clastersB[0].append([x, y])\n",
    "    elif y > 21:\n",
    "        clastersB[1].append([x, y])\n",
    "    else:\n",
    "        clastersB[2].append([x, y])\n",
    "\n",
    "def f(D): # функция для нахождения ценктра кластера\n",
    "    s = []\n",
    "    for i in D:\n",
    "        sm = sum(dist(i,j) for j in D) # находит сумму расстояний от точки i до все остальных точек в кластере\n",
    "        s.append([sm, i])\n",
    "    return min(s)[1] # возвращает точку с минимальной суммой расстояний до других точек\n",
    "\n",
    "centersA = [f(i) for i in clastersA] # вставляем все класеры из файла A в функцию f() и находим все центральные точки\n",
    "centersB = [f(i) for i in clastersB] # соответственно для файла B\n",
    "\n",
    "Pax = sum(x for x,y in centersA) * 10000 # сумма иксов (абсцисс) из координат центров\n",
    "Pay = sum(y for x,y in centersA) * 10000 # сумма игруков (ординат)\n",
    "print(int(Pax), int(Pay))\n",
    "\n",
    "Qbmin = min(dist(i, [0,0]) for i in centersB) * 10000 # минимальное из расстояний от центров кластеров файла B до начала координат\n",
    "Qbmax = max(dist(i, [0,0]) for i in centersB) * 10000 # максимальное расстояние\n",
    "\n",
    "print(int(Qbmin), int(Qbmax))"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
