{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "e6793b57",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "16\n"
     ]
    }
   ],
   "source": [
    "for N in range(40): #ГЕНЕРАЦИЯ\n",
    "    New = \"\"   \n",
    "    Nbin = bin(N)[2::]  #ПЕРЕВОДИМ ЧИСЛО N из 10 в 2 (без учета первых 2 символов)\n",
    "    if Nbin.count(\"1\") % 2 == 0:  #проверяем количество едениц в полученной строке\n",
    "        New += \"10\" + Nbin[2::] + \"0\" \n",
    "    else:\n",
    "        New += \"11\" + Nbin[2::] + \"1\"\n",
    "    END = int(New,2) #переводим из 2 в 10 сс\n",
    "    if END > 40:\n",
    "        break\n",
    "print(N)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "e62ca8ee",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1011\n"
     ]
    }
   ],
   "source": [
    "for N in range(999,1020):\n",
    "    a = bin(N)[2::]\n",
    "    b = \"\"\n",
    "    for i in a:\n",
    "        if i == \"0\":\n",
    "            b = b+\"1\"\n",
    "        else:\n",
    "            b=b+\"0\"\n",
    "    if (int(a,2)-int(b,2)) == 999:\n",
    "        print(N)\n",
    "        break"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "7385c09b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4   19\n",
      "5   46\n",
      "6   54\n",
      "7   31\n",
      "8   70\n",
      "9   73\n",
      "10   43\n",
      "11   94\n",
      "12   100\n",
      "13   55\n",
      "14   118\n",
      "15   127\n",
      "16   67\n",
      "17   142\n",
      "18   146\n",
      "19   79\n",
      "20   166\n",
      "21   173\n",
      "22   91\n",
      "23   190\n",
      "24   192\n",
      "25   103\n",
      "26   214\n",
      "27   219\n",
      "28   115\n",
      "29   238\n",
      "30   246\n",
      "31   127\n",
      "32   262\n",
      "33   265\n",
      "34   139\n",
      "35   286\n",
      "36   292\n",
      "37   151\n",
      "38   310\n",
      "39   319\n",
      "40   163\n",
      "41   334\n",
      "42   338\n",
      "43   175\n",
      "44   358\n",
      "45   365\n",
      "46   187\n",
      "47   382\n",
      "48   384\n",
      "49   199\n",
      "50   406\n",
      "51   411\n",
      "52   211\n",
      "53   430\n",
      "54   438\n",
      "55   223\n",
      "56   454\n",
      "57   457\n",
      "58   235\n",
      "59   478\n",
      "60   484\n",
      "61   247\n",
      "62   502\n",
      "63   511\n",
      "64   259\n",
      "65   526\n",
      "66   530\n",
      "67   271\n",
      "68   550\n",
      "69   557\n",
      "70   283\n",
      "71   574\n",
      "72   576\n",
      "73   295\n",
      "74   598\n",
      "75   603\n",
      "76   307\n",
      "77   622\n",
      "78   630\n",
      "79   319\n",
      "80   646\n",
      "81   649\n",
      "82   331\n",
      "83   670\n",
      "84   676\n",
      "85   343\n",
      "86   694\n",
      "87   703\n",
      "88   355\n",
      "89   718\n",
      "90   722\n",
      "91   367\n",
      "92   742\n",
      "93   749\n",
      "94   379\n",
      "95   766\n",
      "96   768\n",
      "97   391\n",
      "98   790\n",
      "99   795\n"
     ]
    }
   ],
   "source": [
    "# На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.\n",
    "# 1. Строится двоичная запись числа N.\n",
    "# 2. Далее эта запись обрабатывается по следующему правилу:\n",
    "# а) если число N делится на 3, то к этой записи дописываются три последние двоичные цифры;\n",
    "# б) если число N на 3 не делится, то остаток от деления умножается на 3, переводится в двоичную запись и дописывается в конец\n",
    "# числа.\n",
    "# Полученная таким образом запись является двоичной записью искомого числа R.\n",
    "# 3. Результат переводится в десятичную систему и выводится на экран.\n",
    "# Например, для исходного числа 12 = 11002 результатом является число 11001002 = 100, а для исходного числа 4 = 1002\n",
    "# результатом является число 100112 = 19.\n",
    "# Укажите максимальное число N, после обработки которого с помощью этого алгоритма получается число R, меньшее чем 76.\n",
    "for a in range(4,100): # начинаем цикл от 4\n",
    "    if a % 3 == 0: # если число кратно 3\n",
    "        r = bin(a)[2::] + bin(a)[-3::] #к двоичной записи дописываются три последние двоичные цифры;\n",
    "        print(a, \" \", int(r,2))\n",
    "    else:\n",
    "        c = a%3*3 # если число N на 3 не делится, то остаток от деления умножается на 3\n",
    "        r = bin(a)[2::] + bin(c)[2::] #  переводится в двоичную запись и дописывается в конец числа.\n",
    "        print(a, \" \", int(r,2))\n",
    "# в полученном списке ищем последнее число, что не больше 76\n",
    "# ответ 16"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2fc379cf",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
